

Mobile IP Working Group                                     F. Johansson
Internet-Draft                                               ipUnplugged
Expires: November 15, 2002                                  T. Johansson
                                                                Ericsson
                                                            May 17, 2002


                   AAA NAI for Mobile IPv4 Extension
                     draft-ietf-mobileip-aaa-nai-01

Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at http://
   www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on November 15, 2002.

Copyright Notice

   Copyright (C) The Internet Society (2002).  All Rights Reserved.

Abstract

   When a mobile node moves between two foreign networks it has to be
   reauthenticated.  If the home network has multiple AAA servers the
   reauthentication request may not be received by the same AAAH as
   previous authentication requests.

   In order for the new AAAH to be able to forward the request to the
   correct HA it has to know the identity of the HA.  This document
   defines an extension that enables the HA to pass its identity to the
   mobile node which can in turn pass it to the AAA server when changing
   point of attachment.  This document specifies a NAI extension that



Johansson & Johansson    Expires November 15, 2002              [Page 1]

Internet-Draft      AAA NAI for Mobile IPv4 Extension           May 2002


   can carry these NAIs.

Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3

   2.  Requirements terminology . . . . . . . . . . . . . . . . . . .  3

   3.  AAA NAI Extension  . . . . . . . . . . . . . . . . . . . . . .  4
   3.1 Processing of the AAA NAI Extension  . . . . . . . . . . . . .  5

   4.  HA Identity subtype  . . . . . . . . . . . . . . . . . . . . .  5

   5.  AAAH Identity subtype  . . . . . . . . . . . . . . . . . . . .  6

   6.  Security Considerations  . . . . . . . . . . . . . . . . . . .  6

   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . .  6

   8.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  6

       Noramtive References . . . . . . . . . . . . . . . . . . . . .  7

       Informative References . . . . . . . . . . . . . . . . . . . .  7

       Authors' Addresses . . . . . . . . . . . . . . . . . . . . . .  7

       Full Copyright Statement . . . . . . . . . . . . . . . . . . .  8























Johansson & Johansson    Expires November 15, 2002              [Page 2]

Internet-Draft      AAA NAI for Mobile IPv4 Extension           May 2002


1. Introduction

   When building networks one would like to be able to have redundancy.
   In order to achieve this, one might place multiple AAA servers in one
   domain.  When a mobile node registers via a visited network the
   authentication will be handled by one of the AAA servers in the home
   domain.  At a later point, when the mobile node moves to another
   visited domain it again has to be authenticated.  However, due to the
   redundancy offered by the AAA protocol, it can not be guaranteed that
   the authentication will be handled by the same AAAH server as the
   previous one which can cause problems when trying to contact the HA
   assigned during this session.

   To solve this the home agent MUST include the AAAH NAI in the
   registration reply message, sent via the AAA infrastructure, which
   the mobile node then MUST include in every subsequent registration
   request sent to a foreign agent when changing point of attachment.

   Furthermore, the only information that is available about the home
   agent in the registration request is the IP address as defined in RFC
   3220 [1].  This is unfortunately not enough, since the AAA
   infrastructure needs to know the FQDN identity of the home agent to
   be able to correctly handle the assignment of the home agent.  A
   reverse DNS lookup would only disclose the identity of the Mobile IP
   interface for that HA IP address, which may or may not be the same as
   the AAA interface of the home agent.  One way of solving this problem
   would be for the home agent to include its identity in the
   registration reply so that it can be included by the mobile node in
   the coming registration requests when changing point of attachment.

2. Requirements terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [3].

   The Mobile IP related terminology used in this document is described
   in RFC 3220 [1].

   The Mobile IP related terminology described in RFC 3220 [1] is used
   in this document.  In addition, the following terms are used:

   AAAH
      AAA Server in the Home Network

   AAAF
      AAA Server in the Foreign Network




Johansson & Johansson    Expires November 15, 2002              [Page 3]

Internet-Draft      AAA NAI for Mobile IPv4 Extension           May 2002


   Authentication
      The process of verifying (using cryptographic techniques, for all
      applications in this specification) the identity of the originator
      of a message.

   Foreign Network
      Any network other than the mobile node's Home network.

   FQDN
      Fully Qualified Domain Name.

   Home Network
      A network, possible virtual, having a network prefix matching that
      of a mobile node's home address.  Note that standard IP routing
      mechanisms will deliver datagrams destined to a mobile node's Home
      Address to the mobile node's Home Network.

   Identity
      The identity of a node is equal to its FQDN.

   NAI
      Network Access Identifier [4].

   Visited Network
      A network other than a mobile node's Home Network, to which the
      mobile node is currently connected.


3. AAA NAI Extension

   This section defines an AAA NAI Extension, used by any extension that
   must carry data in the format of an NAI [5].  This extension may be
   carried by Registration Request and Reply messages.


















Johansson & Johansson    Expires November 15, 2002              [Page 4]

Internet-Draft      AAA NAI for Mobile IPv4 Extension           May 2002


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |     Type      |   Length      |   Sub-Type    |    NAI ...
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Type
            (Type to be assigned by IANA) (skippable) [1]

   Length   8-bit unsigned integer.  Length of the extension, in octets,
            excluding the extension Type and the extension Length
            fields.  This field MUST be set to 1 plus the total length
            of the NAI field.

   Sub-Type This field describes the type of the entity which owns the
            NAI.  The following subtypes are defined:

            1    HA Identity NAI HA Identity (Section 4)

            2    AAAH Identity NAI AAAH Identity (Section 5)

   NAI      Contains the NAI [4] in a string format.


3.1 Processing of the AAA NAI Extension

   When a mobile node or home agent adds an AAA NAI extension to a
   registration message, the extension MUST appear prior to any
   authentication extensions.

   In the event the foreign agent adds an AAA NAI extension to a
   registration message, the extension MUST appear prior to any
   authentication extensions added by the FA.

4. HA Identity subtype

   The HA identity uses subtype 1 of the AAA NAI Extension.  It contains
   the NAI of the AAA interface of the HA in the form hostname@realm.
   Together the hostname and realm forms the complete FQDN
   (hostname.realm) of the HA's AAA interface.

   The home agent MUST provide this in every registration reply sent to
   the mobile node destined through the AAA infrastructure.

   A mobile node MUST provide this in every registration request sent
   when re-authenticating, or when requesting a specific IP address at
   initial authentication.




Johansson & Johansson    Expires November 15, 2002              [Page 5]

Internet-Draft      AAA NAI for Mobile IPv4 Extension           May 2002


   The foreign agent MUST provide it to the AAA server by means
   described in [2].

5. AAAH Identity subtype

   The AAAH identity uses subtype 2 of the AAA NAI Extension.  It
   contains the NAI of the home AAA server in the form hostname@realm.
   Together the hostname and realm forms the complete FQDN
   (hostname.realm) of the home AAA servers interface.

   The home agent MUST provide this in every registration reply sent to
   the mobile node destined through the AAA infrastructure.

   A mobile node MUST always save the latest AAAH Identity received in
   the registration reply message and MUST provide the AAAH Identity in
   every registration request sent when re-authenticating.

   If the AAAH identity is present, the foreign agent MUST include this
   identity when requesting the Mobile Node authentication through the
   AAA infrastructure as described in [2].

6. Security Considerations

   This specification introduces new Mobile IP extensions that are used
   to carry mobility agent and AAA server identities, in the form of
   Network Access Identifiers.  It is assumed that the Mobile IP
   messages that would carry these extensions would be authenticated in
   the manner that is described in [4], or any follow-on authentication
   mechanisms.  Therefore, this specification does not lessen the
   security of Mobile IP messages.

   It should be noted, that the identities sent in the extensions
   specified herein MAY be sent in the clear over the network.  However,
   the authors do not envision that this information would create any
   security issues.

7. IANA Considerations

   The value assigned to the AAA NAI Extension MUST be a unique value
   from the IANA number space for Mobile IPv4 skippable extensions.

8. Acknowledgements

   Thanks to the original authors of the GNAIE draft, Mohamed M Khalil,
   Emad Qaddoura, Haseeb Akhtar, Pat R.  Calhoun.  The original draft
   was removed from the MIP WG charter when no use was seen for the
   extension.  The original ideas has been reused in this draft.




Johansson & Johansson    Expires November 15, 2002              [Page 6]

Internet-Draft      AAA NAI for Mobile IPv4 Extension           May 2002


   Also thanks to Henrik Levkowetz and Kevin Purser for valuable
   feedback and help when writing this draft.

Noramtive References

   [1]  Perkins, C., "IP Mobility Support for IPv4", RFC 3220, January
        2002.

   [2]  Perkins, C., Calhoun, P. and T. Johansson, "Diameter Mobile IPv4
        Application", draft-ietf-aaa-diameter-mobileip-10 (work in
        progress), April 2002.

Informative References

   [3]  Bradner, S., "Key words for use in RFCs to Indicate Requirement
        Levels", BCP 14, RFC 2119, March 1997.

   [4]  Aboba, B. and M. Beadles, "The Network Access Identifier", RFC
        2486, January 1999.

   [5]  Calhoun, P. and C. Perkins, "Mobile IP Network Access Identifier
        Extension for IPv4", RFC 2794, March 2000.


Authors' Addresses

   Fredrik Johansson
   ipUnplugged AB
   Arenavagen 33
   Stockholm  S-121 28
   SWEDEN

   Phone: +46 8 725 5916
   EMail: fredrik@ipunplugged.com


   Tony Johansson
   Ericsson Inc
   2100 Shattuck Ave.
   Berkeley, CA  94704
   USA

   Phone: +1 510 541 8783
   EMail: tony.johansson@ericsson.com







Johansson & Johansson    Expires November 15, 2002              [Page 7]

Internet-Draft      AAA NAI for Mobile IPv4 Extension           May 2002


Full Copyright Statement

   Copyright (C) The Internet Society (2002).  All Rights Reserved.

   This document and translations of it may be copied and furnished to
   others, and derivative works that comment on or otherwise explain it
   or assist in its implementation may be prepared, copied, published
   and distributed, in whole or in part, without restriction of any
   kind, provided that the above copyright notice and this paragraph are
   included on all such copies and derivative works.  However, this
   document itself may not be modified in any way, such as by removing
   the copyright notice or references to the Internet Society or other
   Internet organizations, except as needed for the purpose of
   developing Internet standards in which case the procedures for
   copyrights defined in the Internet Standards process must be
   followed, or as required to translate it into languages other than
   English.

   The limited permissions granted above are perpetual and will not be
   revoked by the Internet Society or its successors or assigns.

   This document and the information contained herein is provided on an
   "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
   TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING
   BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION
   HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
   MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.

Acknowledgement

   Funding for the RFC Editor function is currently provided by the
   Internet Society.



















Johansson & Johansson    Expires November 15, 2002              [Page 8]

